contextablemark/esp32-agui/agui-voice/main/agui_voice_main.c
// AG-UI on-device voice client — application entry point.
// P0/P0.5: WiFi (multi-SSID + captive portal). P1: streaming STT (Soniox). P2: AG-UI client.
// P3: chat UI on the AMOLED + BOOT-button push-to-talk. See docs/agui-voice-plan.md.
//
// Turn model (P3 PTT): no continuous STT session. Hold the BOOT button → open the Soniox session
// and stream the mic (live transcript in the status line); release → stop the session and send the
// utterance to the AG-UI agent. Session is open only while held → no idle Soniox timeout, no
// streamed-silence garbage, and the button defines the turn boundary.

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>
#include <math.h>

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/queue.h"
#include "esp_log.h"
#include "esp_system.h"
#include "esp_heap_caps.h"
#include "esp_timer.h"
#include "esp_pm.h"
#include "nvs_flash.h"
#include "iot_button.h"
#include "button_gpio.h"

#include "net_prov.h"
#include "app_cfg.h"
#include "soniox_client.h"
#include "agui_client.h"
#include "device_tools.h"
#include "chat_ui.h"

#include "esp_codec_dev.h"
#include "bsp/esp32_s3_touch_amoled_1_8.h"

static const char *TAG = "agui_voice";

#define PTT_GPIO    0                 // BOOT button: strapping pin at RESET only; normal input at runtime
#define IDLE_HINT   "Hold Top Button to talk"

static QueueHandle_t s_ptt_q;          // button events: 1 = press (down), 0 = release (up)
static volatile bool s_listening;      // a hold is in progress
static char s_ptt_final[512];          // finalized text accumulated across mid-hold endpoints
static char s_ptt_run[640];            // last interim ("running") transcript

static void init_nvs(void)
{
    esp_err_t err = nvs_flash_init();
    if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        err = nvs_flash_init();
    }
    ESP_ERROR_CHECK(err);
}

// Apply the configured POSIX TZ (from the portal dropdown; default UTC0) so localtime_r() yields
// local time for the local_time ambient-context entry. Re-call after a reconfigure that may change it.
static void apply_timezone(void)
{
    char tz[64];
    setenv("TZ", (app_cfg_get(APP_CFG_TZ, tz, sizeof tz) && tz[0]) ? tz : "UTC0", 1);
    tzset();
}

// --- Soniox transcript callbacks (fire from the ws task; only meaningful while holding PTT) ---
static void on_partial(const char *text, void *ctx)
{
    if (!s_listening || !text) return;
    strlcpy(s_ptt_run, text, sizeof s_ptt_run);
    char live[1024];
    snprintf(live, sizeof live, "%s%s", s_ptt_final, text);   // finalized so far + current interim
    chat_ui_status(live[0] ? live : "Listening...");
    ESP_LOGI("stt", "~ %s", live);
}
static void on_turn(const char *text, void *ctx)             // Soniox endpoint mid-hold: keep the segment
{
    if (!s_listening || !text || !*text) return;
    strlcat(s_ptt_final, text, sizeof s_ptt_final);
    strlcat(s_ptt_final, " ", sizeof s_ptt_final);
    s_ptt_run[0] = '\0';
}

// --- AG-UI run handlers (fire from the ptt task during agui_run) ---
// They drive the chat bubbles (TEXT_*) and the ephemeral status line (RUN_*/REASONING_*/
// TOOL_CALL_*) — P4 live agent activity: status shows what the agent is doing and clears
// when the reply text starts streaming.
static bool s_assist_started;          // assistant bubble open for the current message?
static bool s_run_error;               // run ended in error → keep the "Error" status visible

// --- P7 client tools: pending list ------------------------------------------------------------
// Client-tool calls the agent makes during a run are RECORDED here by h_tool_call (which runs INSIDE
// agui_run under s_lock — so it may only copy strings, never dispatch/re-run). run_agent_turn drains
// the list AFTER agui_run returns, executes each tool, returns a result, then re-runs. Owned solely
// by ptt_task (single producer/consumer, never concurrent) → no locking.
#define AGUI_TOOL_MAX_ITERS 5      // hard cap on run→tool→run cycles per utterance
#define PEND_MAX            4      // max client tool calls captured per run
#define TOOL_ID_MAX        64
#define TOOL_NAME_MAX      48
#define TOOL_ARGS_MAX     512

typedef struct {
    char id[TOOL_ID_MAX];
    char name[TOOL_NAME_MAX];
    char args[TOOL_ARGS_MAX];      // raw JSON string from the SDK ("{}" if empty)
} pending_tool_t;

static pending_tool_t s_pending[PEND_MAX];
static int            s_pending_n;        // client tool calls recorded this run
static bool           s_pending_overflow;

static void h_run_started(void *c)
{
    ESP_LOGI("agui", "thinking...");
    chat_ui_status("Thinking...");
    printf("\nAI: "); fflush(stdout);
}
static void h_text_delta(const char *d, void *c)
{
    if (!s_assist_started) {                 // first delta of this message → open a bubble…
        chat_ui_begin_assistant();
        chat_ui_status("");                  // …and clear the reasoning/tool indicator
        s_assist_started = true;
    }
    chat_ui_append_assistant(d);
    printf("%s", d); fflush(stdout);
}
static void h_text_end(void *c)
{
    s_assist_started = false;                // message done → the next TEXT_MESSAGE gets its own bubble
    printf("\n"); fflush(stdout);
}
static void h_reasoning(const char *d, bool active, void *c)
{
    if (active) chat_ui_status("Reasoning...");   // ephemeral; cleared when the reply text starts
    if (d && *d) ESP_LOGI("agui", "reasoning: %s", d);
}
static void h_tool_call(const char *id, const char *name, const char *args, void *c)
{
    char s[96];
    snprintf(s, sizeof s, "Using %s...", (name && *name) ? name : "tool");
    chat_ui_status(s);                       // transient chip; the next event overwrites it
    ESP_LOGI("agui", "TOOL_CALL %s (%s) args=%s", name, id, args);

    // Record ONLY tools we can execute. Server/agent tools are run by the agent itself; we owe no
    // result for them, so we must not capture (and later try to answer) them. Runs inside agui_run
    // under s_lock → copy three strings and return; NO dispatch, NO re-run (would deadlock).
    if (!device_tools_is_client(name)) return;
    if (s_pending_n >= PEND_MAX) { s_pending_overflow = true; return; }
    pending_tool_t *p = &s_pending[s_pending_n++];
    strlcpy(p->id,   id   ? id   : "",                sizeof p->id);
    strlcpy(p->name, name ? name : "",                sizeof p->name);
    strlcpy(p->args, (args && args[0]) ? args : "{}", sizeof p->args);
}
static void h_run_finished(void *c) { ESP_LOGI("agui", "run finished"); }
static void h_error(const char *m, void *c)
{
    ESP_LOGE("agui", "run error: %s", m);
    chat_ui_status("Error");
    s_run_error = true;
}

static const agui_handlers_t s_handlers = {
    .on_run_started  = h_run_started,
    .on_text_delta   = h_text_delta,
    .on_text_end     = h_text_end,
    .on_reasoning    = h_reasoning,
    .on_tool_call    = h_tool_call,
    .on_run_finished = h_run_finished,
    .on_error        = h_error,
};

// Render the user turn, run one AG-UI turn (streams the reply into the chat), restore the idle hint.
static void run_agent_turn(const char *text)
{
    char url[APP_CFG_VAL_MAX], token[APP_CFG_VAL_MAX];
    ESP_LOGI(TAG, "You: %s", text);
    chat_ui_add_user(text);

    if (!app_cfg_get(APP_CFG_AGUI_URL, url, sizeof url)) {
        ESP_LOGW(TAG, "no AG-UI URL configured");
        chat_ui_status("No AG-UI URL");
        return;
    }
    bool have_tok = app_cfg_get(APP_CFG_AGUI_TOKEN, token, sizeof token);

    s_assist_started = false;
    s_run_error      = false;
    chat_ui_status("Thinking...");
    agui_cfg_t acfg = { .endpoint = url, .auth_bearer = have_tok ? token : NULL, .thread_id = NULL };
    cJSON *tools    = device_tools_manifest();     // advertised on EVERY run (NULL ⇒ no tools)

    // The agent may call device client tools (set_timer, ...). Advertise them each run; after each
    // run, drain any recorded calls — execute on-device, append a tool result to history, then re-run
    // with NULL user_text so the agent continues. Bounded by AGUI_TOOL_MAX_ITERS. Every agui_run /
    // agui_tool_result call happens HERE on ptt_task with s_lock free between them (no deadlock).
    const char *user_text = text;                  // first run carries the utterance; continuations don't
    for (int iter = 0; iter < AGUI_TOOL_MAX_ITERS; iter++) {
        s_pending_n        = 0;                    // reset capture for THIS run
        s_pending_overflow = false;

        cJSON *device_ctx = device_context_build();          // fresh ambient context each run
        agui_run(&acfg, user_text, device_ctx, tools, NULL, &s_handlers, NULL);  // BLOCKS; fills s_pending
        cJSON_Delete(device_ctx);

        if (s_run_error)   break;                  // transport/RUN_ERROR → stop (h_error kept "Error" up)
        if (s_pending_n == 0) break;               // no client tool calls → turn complete
        if (s_pending_overflow) ESP_LOGW(TAG, "tool calls truncated to %d this run", PEND_MAX);

        // Execute each recorded client tool and round-trip a result into history.
        for (int i = 0; i < s_pending_n; i++) {
            pending_tool_t *p = &s_pending[i];
            cJSON *args   = cJSON_Parse(p->args[0] ? p->args : "{}");
            cJSON *result = NULL;
            esp_err_t err = device_tools_dispatch(p->name, args, &result);
            cJSON_Delete(args);
            if (err != ESP_OK || !result) {        // synthesize an error result so the agent still gets
                if (result) cJSON_Delete(result);  // a tool message (history stays paired) and can react
                result = cJSON_CreateObject();
                cJSON_AddBoolToObject(result, "ok", false);
                cJSON_AddStringToObject(result, "error", esp_err_to_name(err));
            }
            agui_tool_result(p->id, result);       // appends one Tool-role msg to s_agent history
            cJSON_Delete(result);
        }
        user_text = NULL;                          // continuation runs add NO user message
    }

